СРО_Копия/src/Reports/СРО_СводныйОтчетПоКПК/СРО_СводныйОтчетПоКПК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СРО_СводныйОтчетПоКПК</name>
</mdclass:Report>

СРО_Копия/src/InformationRegisters/СРО_ОтветственныеЛицаКПК/СРО_ОтветственныеЛицаКПК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СРО_ОтветственныеЛицаКПК</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>КПК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СРО_Копия/src/Enums/ТипДокумента/ТипДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДокумента</name>
  <enumValues>
    <name>ОтчетОДеятельностиКооператива</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПерсональномСоставе</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОДеятельностиКооперативаРазделы10_11</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскаяОтчетность</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбОперацияхДС</name>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Enums/КодДокумента/КодДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодДокумента</name>
  <enumValues>
    <name>ОКУД_0420820_21631</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21632</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21633</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21634</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_2164</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21641</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21642</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21644</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_2165</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21632</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21633</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21634</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21643</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_2165</name>
  </enumValues>
  <enumValues>
    <name>КодНеОпределен</name>
  </enumValues>
  <enumValues>
    <name>БО_2163</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2163</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2164</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_21641</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2165</name>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Catalogs/Разделы/Разделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Разделы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Раздел1</name>
      <description>Раздел 1</description>
    </items>
    <items>
      <name>Раздел10</name>
      <description>Раздел 10</description>
    </items>
    <items>
      <name>Раздел11</name>
      <description>Раздел 11</description>
    </items>
    <items>
      <name>Раздел12</name>
      <description>Раздел 12</description>
    </items>
    <items>
      <name>Раздел13</name>
      <description>Раздел 13</description>
    </items>
    <items>
      <name>Раздел2</name>
      <description>Раздел 2</description>
        </content>
          </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
          </content>
          </content>
        </content>
          </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел3</name>
      <description>Раздел 3</description>
      </content>
        </content>
      </content>
        </content>
      </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел4</name>
      <description>Раздел 4</description>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
        </content>
        </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел5</name>
      <description>Раздел 5</description>
      </content>
    </items>
    <items>
      <name>Раздел6</name>
      <description>Раздел 6</description>
      </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел7</name>
      <description>Раздел 7</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел8</name>
      <description>Раздел 8</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел9</name>
      <description>Раздел 9</description>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРаздела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СРО_Копия/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииКПК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРеестреСРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсключенияИзСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.СРО_Субъекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеГУ</name>
    <type>
      <types>CatalogRef.СРО_УправленияГУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидацияБанкротство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предписания</name>
    <attributes>
      <name>ДатаНачалаПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

СРО_Копия/src/Reports/СРО_СводныйОтчетПоКПК/ManagerModule.bsl
// -99999 - ""							   
// -77777 - "-"							   
							   
Функция ПолучитьПредставлениеДатыОтчета(ДатаОкончанияОтчетногоПериода)
	ДатаДень = День(ДатаОкончанияОтчетногоПериода);
	ДатаМесяц = Месяц(ДатаОкончанияОтчетногоПериода);
	
	Если ДатаДень = 31 И ДатаМесяц = 3 Тогда
		Квартал = "1 кв";
	ИначеЕсли ДатаДень = 30 И ДатаМесяц = 6 Тогда
		Квартал = "2 кв";	
	ИначеЕсли ДатаДень = 30 И ДатаМесяц = 9 Тогда
		Квартал = "3 кв";		
	ИначеЕсли ДатаДень = 31 И ДатаМесяц = 12 Тогда
		Квартал = "4 кв";			
	КонецЕсли;
	
	ПредставлениеДаты = Квартал + " " + Стрзаменить(Год(ДатаОкончанияОтчетногоПериода), Символы.НПП, "") +"г.";
	
	Возврат ПредставлениеДаты;
	
КонецФункции

Функция ПолучитьТекстЗапроса()
	
	// попытался оптимизировать, нуждно потестить. Пока остался старый
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Разделы.Ссылка КАК Ссылка,
	|	Разделы.Код КАК Код
	|ПОМЕСТИТЬ ВТ_Разделы
	|ИЗ
	|	Справочник.Разделы КАК Разделы
	|ГДЕ
	|	Разделы.Ссылка В ИЕРАРХИИ(&СписокРазделов)
	|	И НЕ Разделы.Ссылка В (&СписокРазделов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КПК
	|ПОМЕСТИТЬ ВТ_КПК
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ДатаИсключенияИзСРО <> &ПустаяДата
	|	И Контрагенты.Ссылка В(&МассивКПК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
	|	СУММА(ОтчетностьКПКТаблицаПоказателей.Показатель1) КАК Показатель1,
	|	СУММА(ВЫБОР
	|			КОГДА ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""7_""
	|					ИЛИ ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""8_""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель2
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Показатель2,
	|	СУММА(ВЫБОР
	|			КОГДА ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""7_""
	|					ИЛИ ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""8_""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель3
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Показатель3,
	|	СУММА(ВЫБОР
	|			КОГДА ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""7_""
	|					ИЛИ ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""8_""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель4
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Показатель4,
	|	СУММА(ВЫБОР
	|			КОГДА ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""7_""
	|					ИЛИ ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""8_""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель5
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Показатель5,
	|	СУММА(ВЫБОР
	|			КОГДА ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""7_""
	|					ИЛИ ПОДСТРОКА(ОтчетностьКПКТаблицаПоказателей.Раздел.Код, 1, 2) = ""8_""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель6
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Показатель6
	|ПОМЕСТИТЬ ВТ_ДокументыОтчетности
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ИспользоватьДокумент = ИСТИНА
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&СписокРазделов)
	|	И НЕ ОтчетностьКПКТаблицаПоказателей.Раздел В (&СписокРазделов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ДокументыОтчетности.ДокументОтчетности, ВТ_КПК.КПК) КАК ДокументОтчетности,
	|	ВТ_КПК.КПК КАК КПК,
	|	ВТ_ДокументыОтчетности.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	ВТ_ДокументыОтчетности.Раздел КАК Раздел,
	|	СУММА(ВТ_ДокументыОтчетности.Показатель1) КАК Показатель1,
	|	СУММА(ВТ_ДокументыОтчетности.Показатель2) КАК Показатель2,
	|	СУММА(ВТ_ДокументыОтчетности.Показатель3) КАК Показатель3,
	|	СУММА(ВТ_ДокументыОтчетности.Показатель4) КАК Показатель4,
	|	СУММА(ВТ_ДокументыОтчетности.Показатель5) КАК Показатель5,
	|	СУММА(ВТ_ДокументыОтчетности.Показатель6) КАК Показатель6
	|ПОМЕСТИТЬ ВТ_Отчетность
	|ИЗ
	|	ВТ_ДокументыОтчетности КАК ВТ_ДокументыОтчетности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КПК КАК ВТ_КПК
	|		ПО ВТ_ДокументыОтчетности.КПК = ВТ_КПК.КПК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КПК.КПК,
	|	ВТ_ДокументыОтчетности.ДатаОкончанияОтчетногоПериода,
	|	ВТ_ДокументыОтчетности.Раздел,
	|	ВТ_ДокументыОтчетности.ДокументОтчетности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_отчетность.ДокументОтчетности КАК ДокументОтчетности
	|ПОМЕСТИТЬ ВТ_ДокументыС6Разделом
	|ИЗ
	|	ВТ_Отчетность КАК ВТ_отчетность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Разделы КАК ВТ_Разделы
	|		ПО ВТ_отчетность.Раздел = ВТ_Разделы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_отчетность.ДокументОтчетности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Разделы.Ссылка КАК Раздел,
	|	ВТ_Разделы.Код КАК Код
	|ПОМЕСТИТЬ ВТ_РазделыДокумента
	|ИЗ
	|	ВТ_Разделы КАК ВТ_Разделы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Отчетность КАК ВТ_отчетность
	|		ПО ВТ_Разделы.Ссылка = ВТ_отчетность.Раздел
	|ГДЕ
	|	ВТ_Разделы.Ссылка В ИЕРАРХИИ(&СписокРазделов)
	|	И НЕ ВТ_Разделы.Ссылка В (&СписокРазделов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РазделыДокумента.Раздел КАК Раздел,
	|	ВТ_РазделыДокумента.Код КАК Код
	|ИЗ
	|	ВТ_РазделыДокумента КАК ВТ_РазделыДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РазделыДокумента.Раздел,
	|	ВТ_РазделыДокумента.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_РазделыДокумента.Раздел.ПорядокСортировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДокументОтчетности КАК ДокументОтчетности,
	|	ВложенныйЗапрос.КПК КАК КПК,
	|	ВложенныйЗапрос.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	ВложенныйЗапрос.Раздел КАК Раздел,
	|	СРЕДНЕЕ(ВложенныйЗапрос.Показатель1) КАК Показатель1,
	|	СРЕДНЕЕ(ВложенныйЗапрос.Показатель2) КАК Показатель2,
	|	СРЕДНЕЕ(ВложенныйЗапрос.Показатель3) КАК Показатель3,
	|	СРЕДНЕЕ(ВложенныйЗапрос.Показатель4) КАК Показатель4,
	|	СРЕДНЕЕ(ВложенныйЗапрос.Показатель5) КАК Показатель5,
	|	СРЕДНЕЕ(ВложенныйЗапрос.Показатель6) КАК Показатель6
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ДокументыС6Разделом.ДокументОтчетности КАК ДокументОтчетности,
	|		ВТ_ДокументыС6Разделом.ДокументОтчетности.КПК КАК КПК,
	|		ВТ_ДокументыС6Разделом.ДокументОтчетности.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|		ВТ_РазделыДокумента.Раздел КАК Раздел,
	|		СУММА(ВЫБОР
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_2""
	|					ТОГДА -99999
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_3""
	|					ТОГДА -99999
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_3_1""
	|					ТОГДА -99999
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_3_2""
	|					ТОГДА -99999
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_3_3""
	|					ТОГДА -99999
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_3_4""
	|					ТОГДА -99999
	|				КОГДА ВТ_РазделыДокумента.Код = ""6_3_4""
	|					ТОГДА -99999
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Показатель1,
	|		0 КАК Показатель2,
	|		0 КАК Показатель3,
	|		0 КАК Показатель4,
	|		0 КАК Показатель5,
	|		0 КАК Показатель6
	|	ИЗ
	|		ВТ_ДокументыС6Разделом КАК ВТ_ДокументыС6Разделом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РазделыДокумента КАК ВТ_РазделыДокумента
	|			ПО (ВТ_РазделыДокумента.Раздел В ИЕРАРХИИ (&Раздел6))
	|				И (ВТ_РазделыДокумента.Раздел <> &Раздел6)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ДокументыС6Разделом.ДокументОтчетности,
	|		ВТ_ДокументыС6Разделом.ДокументОтчетности.КПК,
	|		ВТ_ДокументыС6Разделом.ДокументОтчетности.ДатаОкончанияОтчетногоПериода,
	|		ВТ_РазделыДокумента.Раздел
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_отчетность.ДокументОтчетности,
	|		ВТ_отчетность.КПК,
	|		ВТ_отчетность.ДатаОкончанияОтчетногоПериода,
	|		ВТ_отчетность.Раздел,
	|		СУММА(ВТ_отчетность.Показатель1),
	|		СУММА(ВТ_отчетность.Показатель2),
	|		СУММА(ВТ_отчетность.Показатель3),
	|		СУММА(ВТ_отчетность.Показатель4),
	|		СУММА(ВТ_отчетность.Показатель5),
	|		СУММА(ВТ_отчетность.Показатель6)
	|	ИЗ
	|		ВТ_Отчетность КАК ВТ_отчетность
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_отчетность.ДокументОтчетности,
	|		ВТ_отчетность.КПК,
	|		ВТ_отчетность.ДатаОкончанияОтчетногоПериода,
	|		ВТ_отчетность.Раздел) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОтчетности,
	|	ВложенныйЗапрос.КПК,
	|	ВложенныйЗапрос.ДатаОкончанияОтчетногоПериода,
	|	ВложенныйЗапрос.Раздел
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.КПК.НомерВРеестреСРО,
	|	ВложенныйЗапрос.ДатаОкончанияОтчетногоПериода,
	|	ВложенныйЗапрос.Раздел.ПорядокСортировки
	|ИТОГИ
	|	СУММА(Показатель1),
	|	СУММА(Показатель2),
	|	СУММА(Показатель3),
	|	СУММА(Показатель4),
	|	СУММА(Показатель5),
	|	СУММА(Показатель6)
	|ПО
	|	ДокументОтчетности,
	|	ДатаОкончанияОтчетногоПериода";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция СформироватьТабличныеДокументы(СтруктураПараметров) Экспорт
	
	ДатаНачала = СтруктураПараметров.ДатаНачалаОтчета;
	ДатаОкончания = КонецДня(СтруктураПараметров.ДатаОкончанияОтчета);
	МассивКПК = СтруктураПараметров.МассивКПК;	
	
	Если СтруктураПараметров.Свойство("ТабличныйДокумент") Тогда	
		ТабличныйДокумент = СтруктураПараметров.ТабличныйДокумент;  
	Иначе
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли;      
	
	Если СтруктураПараметров.Свойство("ВыводитьТолькоКПКСОтчетностью") Тогда	
		ВыводитьТолькоКПКСОтчетностью = СтруктураПараметров.ВыводитьТолькоКПКСОтчетностью;  
	Иначе
		ВыводитьТолькоКПКСОтчетностью = Истина;
	КонецЕсли;      
	
	Если СтруктураПараметров.Свойство("ВидОтчета") Тогда	
		ВидОтчета = СтруктураПараметров.ВидОтчета;  
	Иначе
		ВидОтчета = 1;
	КонецЕсли;  
	
	Если СтруктураПараметров.Свойство("МассивУправленийГУ") Тогда	
		МассивУправленийГУ = СтруктураПараметров.МассивУправленийГУ;  
	Иначе
		МассивУправленийГУ = Новый Массив;
	КонецЕсли;  
	
	Если СтруктураПараметров.Свойство("ВидОтбора_КПК_УправлениеГУ") Тогда	
		ВидОтбора_КПК_УправлениеГУ = СтруктураПараметров.ВидОтбора_КПК_УправлениеГУ;  
	Иначе
		ВидОтбора_КПК_УправлениеГУ = "КПК";
	КонецЕсли;                           	 
	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетностьКПК.Ссылка КАК Ссылка,
	               |	ОтчетностьКПК.КПК КАК КПК,
	               |	ОтчетностьКПК.КодДокумента КАК КодДокумента
	               |ПОМЕСТИТЬ ВремОтчетностьКПК
	               |ИЗ
	               |	Документ.ОтчетностьКПК КАК ОтчетностьКПК
	               |ГДЕ
	               |	ОтчетностьКПК.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И 1 = 1
	               |	И ОтчетностьКПК.ИспользоватьДокумент = ИСТИНА
	               |	И ОтчетностьКПК.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипДокумента.ОтчетОДеятельностиКооператива)
	               |	И НЕ ОтчетностьКПК.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка,
	               |	КПК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СРО_ОтветственныеЛицаКПК.КПК КАК КПК,
	               |	СРО_ОтветственныеЛицаКПК.Период КАК Период,
	               |	СРО_ОтветственныеЛицаКПК.Должность КАК Должность,
	               |	СРО_ОтветственныеЛицаКПК.ФизЛицо КАК ФизЛицо
	               |ПОМЕСТИТЬ ВТ_ОтветственныеЛица
	               |ИЗ
	               |	РегистрСведений.СРО_ОтветственныеЛицаКПК КАК СРО_ОтветственныеЛицаКПК
	               |ГДЕ
	               |	СРО_ОтветственныеЛицаКПК.КПК В
	               |			(ВЫБРАТЬ
	               |				ВремОтчетностьКПК.КПК
	               |			ИЗ
	               |				ВремОтчетностьКПК КАК ВремОтчетностьКПК)
	               |	И СРО_ОтветственныеЛицаКПК.Период <= &ДатаОкончания
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	КПК,
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремОтчетностьКПК.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА ВремОтчетностьКПК.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21632)
	               |		ИНАЧЕ ВремОтчетностьКПК.КодДокумента
	               |	КОНЕЦ КАК КодДокумента,
	               |	МАКСИМУМ(ЕСТЬNULL(ВТ_ОтветственныеЛица.Период, &ПустаяДата)) КАК ПериодОтветственноеЛицо
	               |ПОМЕСТИТЬ ВТ_ДокументыОтчетностиБезРазделов
	               |ИЗ
	               |	ВремОтчетностьКПК КАК ВремОтчетностьКПК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветственныеЛица КАК ВТ_ОтветственныеЛица
	               |		ПО ВремОтчетностьКПК.КПК = ВТ_ОтветственныеЛица.КПК
	               |			И (ВТ_ОтветственныеЛица.Период <= ВремОтчетностьКПК.Ссылка.Дата)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВремОтчетностьКПК.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ВремОтчетностьКПК.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21632)
	               |		ИНАЧЕ ВремОтчетностьКПК.КодДокумента
	               |	КОНЕЦ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК Ссылка,
	               |	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
	               |	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК Показатель1,
	               |	ОтчетностьКПКТаблицаПоказателей.Показатель2 КАК Показатель2,
	               |	ОтчетностьКПКТаблицаПоказателей.Показатель3 КАК Показатель3,
	               |	ОтчетностьКПКТаблицаПоказателей.Показатель4 КАК Показатель4,
	               |	ОтчетностьКПКТаблицаПоказателей.Показатель5 КАК Показатель5,
	               |	ОтчетностьКПКТаблицаПоказателей.Показатель6 КАК Показатель6
	               |ПОМЕСТИТЬ ВремВТ_ОтчетностьКПКПоказателей
	               |ИЗ
	               |	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	               |ГДЕ
	               |	ОтчетностьКПКТаблицаПоказателей.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДокументыОтчетностиБезРазделов.Ссылка
	               |			ИЗ
	               |				ВТ_ДокументыОтчетностиБезРазделов КАК ВТ_ДокументыОтчетностиБезРазделов)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗ.Ссылка КАК Ссылка,
	               |	ВложенныйЗ.Ссылка.КПК КАК КПК,
	               |	ВложенныйЗ.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |	ВложенныйЗ.Раздел КАК Раздел,
	               |	СУММА(ВложенныйЗ.Показатель1) КАК Показатель1,
	               |	ВложенныйЗ.Ссылка.КодДокумента КАК КодДокумента,
	               |	ВТ_ДокументыОтчетностиБезРазделов.ПериодОтветственноеЛицо КАК ПериодОтветственноеЛицо,
	               |	СУММА(ВложенныйЗ.Показатель2) КАК Показатель2,
	               |	СУММА(ВложенныйЗ.Показатель3) КАК Показатель3,
	               |	СУММА(ВложенныйЗ.Показатель4) КАК Показатель4,
	               |	СУММА(ВложенныйЗ.Показатель5) КАК Показатель5,
	               |	СУММА(ВложенныйЗ.Показатель6) КАК Показатель6
	               |ПОМЕСТИТЬ ВТ_ОтчетностьКПКПоказателей
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВремВТ_ОтчетностьКПКПоказателей.Ссылка КАК Ссылка,
	               |		ВремВТ_ОтчетностьКПКПоказателей.Раздел КАК Раздел,
	               |		СУММА(ВремВТ_ОтчетностьКПКПоказателей.Показатель1) КАК Показатель1,
	               |		СУММА(ВремВТ_ОтчетностьКПКПоказателей.Показатель2) КАК Показатель2,
	               |		СУММА(ВремВТ_ОтчетностьКПКПоказателей.Показатель3) КАК Показатель3,
	               |		СУММА(ВремВТ_ОтчетностьКПКПоказателей.Показатель4) КАК Показатель4,
	               |		СУММА(ВремВТ_ОтчетностьКПКПоказателей.Показатель5) КАК Показатель5,
	               |		СУММА(ВремВТ_ОтчетностьКПКПоказателей.Показатель6) КАК Показатель6
	               |	ИЗ
	               |		ВремВТ_ОтчетностьКПКПоказателей КАК ВремВТ_ОтчетностьКПКПоказателей
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВремВТ_ОтчетностьКПКПоказателей.Ссылка,
	               |		ВремВТ_ОтчетностьКПКПоказателей.Раздел
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВремВТ_ОтчетностьКПКПоказателей.Ссылка,
	               |		ВремВТ_ОтчетностьКПКПоказателей1.Раздел,
	               |		СУММА(0),
	               |		СУММА(0),
	               |		СУММА(0),
	               |		СУММА(0),
	               |		СУММА(0),
	               |		СУММА(0)
	               |	ИЗ
	               |		ВремВТ_ОтчетностьКПКПоказателей КАК ВремВТ_ОтчетностьКПКПоказателей,
	               |		ВремВТ_ОтчетностьКПКПоказателей КАК ВремВТ_ОтчетностьКПКПоказателей1
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВремВТ_ОтчетностьКПКПоказателей.Ссылка,
	               |		ВремВТ_ОтчетностьКПКПоказателей1.Раздел) КАК ВложенныйЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыОтчетностиБезРазделов КАК ВТ_ДокументыОтчетностиБезРазделов
	               |		ПО ВложенныйЗ.Ссылка = ВТ_ДокументыОтчетностиБезРазделов.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗ.Ссылка,
	               |	ВТ_ДокументыОтчетностиБезРазделов.ПериодОтветственноеЛицо,
	               |	ВложенныйЗ.Раздел,
	               |	ВложенныйЗ.Ссылка.КПК,
	               |	ВложенныйЗ.Ссылка.ДатаОкончанияОтчетногоПериода,
	               |	ВложенныйЗ.Ссылка.КодДокумента
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка,
	               |	ПериодОтветственноеЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтчетностьКПКПоказателей.Ссылка КАК Ссылка,
	               |	ВТ_ОтчетностьКПКПоказателей.Ссылка.КПК КАК КПК,
	               |	ВТ_ОтчетностьКПКПоказателей.КодДокумента КАК КодДокумента,
	               |	ВТ_ОтчетностьКПКПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |	ВТ_ОтчетностьКПКПоказателей.Раздел КАК Раздел,
	               |	ВТ_ОтветственныеЛица.ФизЛицо КАК ФизЛицо,
	               |	ВТ_ОтветственныеЛица.Должность КАК Должность,
	               |	ВТ_ОтчетностьКПКПоказателей.Показатель1 КАК Показатель1,
	               |	ВТ_ОтчетностьКПКПоказателей.Показатель2 КАК Показатель2,
	               |	ВТ_ОтчетностьКПКПоказателей.Показатель3 КАК Показатель3,
	               |	ВТ_ОтчетностьКПКПоказателей.Показатель4 КАК Показатель4,
	               |	ВТ_ОтчетностьКПКПоказателей.Показатель5 КАК Показатель5,
	               |	ВТ_ОтчетностьКПКПоказателей.Показатель6 КАК Показатель6
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	ВТ_ОтчетностьКПКПоказателей КАК ВТ_ОтчетностьКПКПоказателей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветственныеЛица КАК ВТ_ОтветственныеЛица
	               |		ПО ВТ_ОтчетностьКПКПоказателей.КПК = ВТ_ОтветственныеЛица.КПК
	               |			И ВТ_ОтчетностьКПКПоказателей.ПериодОтветственноеЛицо = ВТ_ОтветственныеЛица.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.Ссылка КАК Ссылка,
	               |	ВТ_Документы.КПК КАК КПК,
	               |	ВТ_Документы.КодДокумента КАК КодДокумента,
	               |	ВТ_Документы.Раздел КАК Раздел,
	               |	ВТ_Документы.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |	ВТ_Документы.ФизЛицо КАК ФизЛицо,
	               |	ВТ_Документы.Должность КАК Должность
	               |ПОМЕСТИТЬ ВТ_ДокументыОтчетности_21632
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |ГДЕ
	               |	ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21632)
	               |	И ВТ_Документы.Раздел В ИЕРАРХИИ(&СписокРазделов_2_16_3_2)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.Ссылка КАК Ссылка,
	               |	ВТ_Документы.КПК КАК КПК,
	               |	ВТ_Документы.КодДокумента КАК КодДокумента,
	               |	ВТ_Документы.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |	ВТ_Документы.Раздел КАК Раздел,
	               |	ВТ_Документы.ФизЛицо КАК ФизЛицо,
	               |	ВТ_Документы.Должность КАК Должность
	               |ПОМЕСТИТЬ ВТ_ДокументыОтчетности_21633
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |ГДЕ
	               |	(ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21633)
	               |			ИЛИ ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21634))
	               |	И ВТ_Документы.Раздел В ИЕРАРХИИ(&СписокРазделов_2_16_3_3)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.Ссылка КАК Ссылка,
	               |	ВТ_Документы.КПК КАК КПК,
	               |	ВТ_Документы.КодДокумента КАК КодДокумента,
	               |	ВТ_Документы.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |	ВТ_Документы.Раздел КАК Раздел,
	               |	ВТ_Документы.ФизЛицо КАК ФизЛицо,
	               |	ВТ_Документы.Должность КАК Должность
	               |ПОМЕСТИТЬ ВТ_ДокументыОтчетности_2164
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |ГДЕ
	               |	(ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_2164)
	               |			ИЛИ ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21641)
	               |			ИЛИ ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21642)
				   |			ИЛИ ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21644)
				   |			ИЛИ ВТ_Документы.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_2165)
	               |			ИЛИ ВТ_Документы.Раздел В ИЕРАРХИИ (&СписокРазделов_2_16_4))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтчетности КАК ДокументОтчетности,
	               |	ВложенныйЗапрос.КПК КАК КПК,
	               |	ВложенныйЗапрос.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |	ВложенныйЗапрос.Раздел КАК Раздел,
	               |	СУММА(ВложенныйЗапрос.Показатель1) КАК Показатель1,
	               |	СУММА(ВложенныйЗапрос.Показатель3) КАК Показатель3,
	               |	СУММА(ВложенныйЗапрос.Показатель4) КАК Показатель4,
	               |	СУММА(ВложенныйЗапрос.Показатель5) КАК Показатель5,
	               |	СУММА(ВложенныйЗапрос.Показатель6) КАК Показатель6,
	               |	ВложенныйЗапрос.КодДокумента КАК КодДокумента,
	               |	ВложенныйЗапрос.НаименованиеРаздела КАК НаименованиеРаздела,
	               |	СУММА(ВложенныйЗапрос.Показатель2) КАК Показатель2,
	               |	МАКСИМУМ(ВложенныйЗапрос.ФизЛицо) КАК ФизЛицо,
	               |	МАКСИМУМ(ВложенныйЗапрос.Должность) КАК Должность,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21631)
	               |			ТОГДА 1
	               |		КОГДА ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21632)
	               |			ТОГДА 2
	               |		КОГДА ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21633)
	               |			ТОГДА 3
	               |		КОГДА ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21634)
	               |			ТОГДА 4
	               |		КОГДА ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_2164)
	               |				ИЛИ ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21641)
	               |				ИЛИ ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21642)
				   |				ИЛИ ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21644)
				   |				ИЛИ ВложенныйЗапрос.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_2165)
	               |			ТОГДА 5
	               |	КОНЕЦ КАК СортировкаПоКоду
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ДокументыОтчетности_21632.Ссылка КАК ДокументОтчетности,
	               |		ВТ_ДокументыОтчетности_21632.КПК КАК КПК,
	               |		ВТ_ДокументыОтчетности_21632.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	               |		ВТ_ДокументыОтчетности_21632.Раздел КАК Раздел,
	               |		СУММА(ВЫБОР
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_2""
	               |					ТОГДА -99999
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_3""
	               |					ТОГДА -99999
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_3_1""
	               |					ТОГДА -99999
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_3_2""
	               |					ТОГДА -99999
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_3_3""
	               |					ТОГДА -99999
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_3_4""
	               |					ТОГДА -99999
	               |				КОГДА ВТ_ДокументыОтчетности_21632.Раздел.Код = ""6_3_4""
	               |					ТОГДА -99999
	               |				ИНАЧЕ ЕСТЬNULL(ВТ_Документы.Показатель1, 0)
	               |			КОНЕЦ) КАК Показатель1,
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель2, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ) КАК Показатель2,
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель3, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ) КАК Показатель3,
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель4, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ) КАК Показатель4,
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель5, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ) КАК Показатель5,
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21632.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель6, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ) КАК Показатель6,
	               |		ВТ_ДокументыОтчетности_21632.КодДокумента КАК КодДокумента,
	               |		ВТ_ДокументыОтчетности_21632.Раздел.Наименование КАК НаименованиеРаздела,
	               |		ВТ_ДокументыОтчетности_21632.ФизЛицо КАК ФизЛицо,
	               |		ВТ_ДокументыОтчетности_21632.Должность КАК Должность
	               |	ИЗ
	               |		ВТ_ДокументыОтчетности_21632 КАК ВТ_ДокументыОтчетности_21632
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	               |			ПО ВТ_ДокументыОтчетности_21632.Ссылка = ВТ_Документы.Ссылка
	               |				И ВТ_ДокументыОтчетности_21632.Раздел = ВТ_Документы.Раздел
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ДокументыОтчетности_21632.КодДокумента,
	               |		ВТ_ДокументыОтчетности_21632.Ссылка,
	               |		ВТ_ДокументыОтчетности_21632.КПК,
	               |		ВТ_ДокументыОтчетности_21632.ДатаОкончанияОтчетногоПериода,
	               |		ВТ_ДокументыОтчетности_21632.Раздел,
	               |		ВТ_ДокументыОтчетности_21632.Раздел.Наименование,
	               |		ВТ_ДокументыОтчетности_21632.ФизЛицо,
	               |		ВТ_ДокументыОтчетности_21632.Должность
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТ_ДокументыОтчетности_21633.Ссылка,
	               |		ВТ_ДокументыОтчетности_21633.КПК,
	               |		ВТ_ДокументыОтчетности_21633.ДатаОкончанияОтчетногоПериода,
	               |		ВТ_ДокументыОтчетности_21633.Раздел,
	               |		СУММА(ЕСТЬNULL(ВТ_Документы.Показатель1, 0)),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель2, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель3, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель4, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель5, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_21633.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель6, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		ВТ_ДокументыОтчетности_21633.КодДокумента,
	               |		НЕОПРЕДЕЛЕНО,
	               |		ВТ_ДокументыОтчетности_21633.ФизЛицо,
	               |		ВТ_ДокументыОтчетности_21633.Должность
	               |	ИЗ
	               |		ВТ_ДокументыОтчетности_21633 КАК ВТ_ДокументыОтчетности_21633
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	               |			ПО ВТ_ДокументыОтчетности_21633.Ссылка = ВТ_Документы.Ссылка
	               |				И ВТ_ДокументыОтчетности_21633.Раздел = ВТ_Документы.Раздел
	               |				И (ВТ_ДокументыОтчетности_21633.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21633)
	               |					ИЛИ ВТ_ДокументыОтчетности_21633.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21634))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ДокументыОтчетности_21633.КодДокумента,
	               |		ВТ_ДокументыОтчетности_21633.Ссылка,
	               |		ВТ_ДокументыОтчетности_21633.КПК,
	               |		ВТ_ДокументыОтчетности_21633.ДатаОкончанияОтчетногоПериода,
	               |		ВТ_ДокументыОтчетности_21633.Раздел,
	               |		ВТ_ДокументыОтчетности_21633.ФизЛицо,
	               |		ВТ_ДокументыОтчетности_21633.Должность
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТ_ДокументыОтчетности_2164.Ссылка,
	               |		ВТ_ДокументыОтчетности_2164.КПК,
	               |		ВТ_ДокументыОтчетности_2164.ДатаОкончанияОтчетногоПериода,
	               |		ВТ_ДокументыОтчетности_2164.Раздел,
	               |		СУММА(ЕСТЬNULL(ВТ_Документы.Показатель1, 0)),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель2, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель3, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель4, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""7_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""8_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель5, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""6_""
	               |						ИЛИ ПОДСТРОКА(ВТ_ДокументыОтчетности_2164.Раздел.Код, 1, 2) = ""7_""
	               |					ТОГДА ЕСТЬNULL(ВТ_Документы.Показатель6, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ),
	               |		ВТ_ДокументыОтчетности_2164.КодДокумента,
	               |		НЕОПРЕДЕЛЕНО,
	               |		ВТ_ДокументыОтчетности_2164.ФизЛицо,
	               |		ВТ_ДокументыОтчетности_2164.Должность
	               |	ИЗ
	               |		ВТ_ДокументыОтчетности_2164 КАК ВТ_ДокументыОтчетности_2164
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	               |			ПО ВТ_ДокументыОтчетности_2164.Ссылка = ВТ_Документы.Ссылка
	               |				И ВТ_ДокументыОтчетности_2164.Раздел = ВТ_Документы.Раздел
	               |				И (ВТ_ДокументыОтчетности_2164.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_2164)
	               |					ИЛИ ВТ_ДокументыОтчетности_2164.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21641)
	               |					ИЛИ ВТ_ДокументыОтчетности_2164.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21642)
				   |					ИЛИ ВТ_ДокументыОтчетности_2164.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_21644)
				   |					ИЛИ ВТ_ДокументыОтчетности_2164.КодДокумента = ЗНАЧЕНИЕ(Перечисление.КодДокумента.ОКУД_0420820_2165))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ДокументыОтчетности_2164.КодДокумента,
	               |		ВТ_ДокументыОтчетности_2164.Ссылка,
	               |		ВТ_ДокументыОтчетности_2164.КПК,
	               |		ВТ_ДокументыОтчетности_2164.ДатаОкончанияОтчетногоПериода,
	               |		ВТ_ДокументыОтчетности_2164.Раздел,
	               |		ВТ_ДокументыОтчетности_2164.ФизЛицо,
	               |		ВТ_ДокументыОтчетности_2164.Должность) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтчетности,
	               |	ВложенныйЗапрос.КПК,
	               |	ВложенныйЗапрос.ДатаОкончанияОтчетногоПериода,
	               |	ВложенныйЗапрос.Раздел,
	               |	ВложенныйЗапрос.КодДокумента,
	               |	ВложенныйЗапрос.НаименованиеРаздела
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СортировкаПоКоду,
	               |	ВложенныйЗапрос.КПК.НомерВРеестреСРО,
	               |	ДатаОкончанияОтчетногоПериода,
	               |	ВложенныйЗапрос.Раздел.ПорядокСортировки
	               |ИТОГИ ПО
	               |	КодДокумента,
	               |	КПК,
	               |	ДокументОтчетности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДокументыОтчетности_21632.Раздел КАК Раздел,
	               |	ВТ_ДокументыОтчетности_21632.Раздел.Код КАК КодРаздела,
	               |	ВТ_ДокументыОтчетности_21632.КодДокумента КАК КодДокумента
	               |ИЗ
	               |	ВТ_ДокументыОтчетности_21632 КАК ВТ_ДокументыОтчетности_21632
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ДокументыОтчетности_21632.Раздел.ПорядокСортировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДокументыОтчетности_21633.Раздел КАК Раздел,
	               |	ВТ_ДокументыОтчетности_21633.Раздел.Код КАК КодРаздела,
	               |	ВТ_ДокументыОтчетности_21633.КодДокумента КАК КодДокумента
	               |ИЗ
	               |	ВТ_ДокументыОтчетности_21633 КАК ВТ_ДокументыОтчетности_21633
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ДокументыОтчетности_21633.Раздел.ПорядокСортировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДокументыОтчетности_2164.Раздел КАК Раздел,
	               |	ВТ_ДокументыОтчетности_2164.Раздел.Код КАК КодРаздела,
	               |	ВТ_ДокументыОтчетности_2164.КодДокумента КАК КодДокумента
	               |ИЗ
	               |	ВТ_ДокументыОтчетности_2164 КАК ВТ_ДокументыОтчетности_2164
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ДокументыОтчетности_2164.Раздел.ПорядокСортировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК КПК,
	               |	КонтрагентыКонтактнаяИнформация.Представление КАК ПредставлениеАдреса
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВремОтчетностьКПК.КПК
	               |			ИЗ
	               |				ВремОтчетностьКПК КАК ВремОтчетностьКПК)
	               |	И КонтрагентыКонтактнаяИнформация.Вид = &ВидКИ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрагентыКонтактнаяИнформация.Ссылка,
	               |	КонтрагентыКонтактнаяИнформация.Представление";

	
	
	СписокРазделов_2_16_3_2 = Новый Массив;
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел2);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел3);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел4);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел5);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел6);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел7);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел8);
	СписокРазделов_2_16_3_2.Добавить(Справочники.Разделы.Раздел11);
	
	СписокРазделов_2_16_3_3 = Новый Массив;
	СписокРазделов_2_16_3_3.Добавить(Справочники.Разделы.Раздел2);
	СписокРазделов_2_16_3_3.Добавить(Справочники.Разделы.Раздел3);
	СписокРазделов_2_16_3_3.Добавить(Справочники.Разделы.Раздел4);	
	СписокРазделов_2_16_3_3.Добавить(Справочники.Разделы.Раздел9);
	
	
	СписокРазделов_2_16_4 = Новый Массив;
	СписокРазделов_2_16_4.Добавить(Справочники.Разделы.Раздел2);
	СписокРазделов_2_16_4.Добавить(Справочники.Разделы.Раздел3);
	СписокРазделов_2_16_4.Добавить(Справочники.Разделы.Раздел4);
	СписокРазделов_2_16_4.Добавить(Справочники.Разделы.Раздел8);
	

	
	запрос.УстановитьПараметр("СписокРазделов_2_16_3_2", СписокРазделов_2_16_3_2);
	запрос.УстановитьПараметр("СписокРазделов_2_16_3_3", СписокРазделов_2_16_3_3);   	
	запрос.УстановитьПараметр("СписокРазделов_2_16_4", СписокРазделов_2_16_4); 
	запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));         
	
	Запрос.УстановитьПараметр("ВидКИ", Справочники.ВидыКонтактнойИнформации.АдресМестонахожденияКонтрагента);
	 	
	Если ВидОтчета = 0 Тогда			
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаОкончания));
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
		
		НачалоПериода = НачалоКвартала(ДатаОкончания);
		ОкончаниеПериода = КонецКвартала(ДатаОкончания);
		КолДопКолонок = 0;
		
		ОтборПоКПК = "1 = 1"; 
		
		Макет = Отчеты.СРО_СводныйОтчетПоКПК.ПолучитьМакет("Макет");
		
	Иначе     
		
		НачалоПериода = НачалоМесяца(ДатаНачала);
		ОкончаниеПериода = КонецМесяца(ДатаОкончания);  
		
		СоединениеПоКПК = "ВНУТРЕННЕЕ";  
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
		
		Если нрег(ВидОтбора_КПК_УправлениеГУ) = "кпк" Тогда
			Запрос.УстановитьПараметр("МассивКПК", МассивКПК);	    		
			ОтборПоКПК = "ОтчетностьКПК.КПК В(&МассивКПК)";
			
		Иначе 
			Запрос.УстановитьПараметр("МассивУправленийГУ", МассивУправленийГУ);	
			ОтборПоКПК = "ОтчетностьКПК.КПК.УправлениеГУ В(&МассивУправленийГУ)";    			
		КонецЕсли;         				   
		
		КолДопКолонок = 1;		
		Макет = Отчеты.СРО_СводныйОтчетПоКПК.ПолучитьМакет("МакетПериод");  		
		
	КонецЕсли; 	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", ОтборПоКПК);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//ВыборкаПоДокументам = РезультатЗапроса[8]; 
	//ТЗРазделы_3_2 = РезультатЗапроса[9].Выгрузить(); 
	//ТЗРазделы_3_3 = РезультатЗапроса[10].Выгрузить(); 
	//ТЗРазделы_4 = РезультатЗапроса[11].Выгрузить(); 
	//
	//ТЗАдреса = РезультатЗапроса[12].Выгрузить(); 
	
	ВыборкаПоДокументам = РезультатЗапроса[9]; 
	ТЗРазделы_3_2 = РезультатЗапроса[10].Выгрузить(); 
	ТЗРазделы_3_3 = РезультатЗапроса[11].Выгрузить(); 
	ТЗРазделы_4 = РезультатЗапроса[12].Выгрузить(); 
	
	ТЗАдреса = РезультатЗапроса[13].Выгрузить(); 

	
	ТЗАдреса.Индексы.Добавить("КПК");
	//РезультатПоКПК = РезультатЗапроса[5]; 	  	
	
	ТабличныйДокумент.НачатьАвтогруппировкуКолонок();
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();  
	
	// Области
	ОбластьШапкаОсновной = Макет.ПолучитьОбласть("Шапка|Основной");	 		
	ОбластьШапкаОсновной.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);	
	ТабличныйДокумент.Вывести(ОбластьШапкаОсновной);    	
	
	ОбластьЗаголовокКодДокумента = Макет.ПолучитьОбласть("ЗаголовокКодДокумента");   
	
	Если ВидОтчета <> 0 Тогда	
		ОбластьЗаголовокКПК = Макет.ПолучитьОбласть("ЗаголовокКПК");   
		ОбластьСтрокаДатаОкончания  = Макет.ПолучитьОбласть("Строка|ДатаОкончания");  
	КонецЕсли;
	
	ОбластьЗаголовокТаблицыОсновной = Макет.ПолучитьОбласть("ЗаголовокТаблицы|Основной"); 	
	ОбластьЗаголовокТаблицыДанныеКПК  = Макет.ПолучитьОбласть("ЗаголовокТаблицы|ДанныеКПК");  	
	ОбластьЗаголовокТаблицыРаздел = Макет.ПолучитьОбласть("ЗаголовокТаблицы|Раздел");  	
	
	ОбластьСтрокаОсновной = Макет.ПолучитьОбласть("Строка|Основной");  		
	ОбластьДанныеКПК = Макет.ПолучитьОбласть("Строка|ДанныеКПК"); 	
	ОбластьСтрокаРаздел = Макет.ПолучитьОбласть("Строка|Раздел"); 		
	
	счКолонок = 0;
	
	МассивРазделов7_8 = Новый Массив;    	
	
	ВыборкаПоКодуДокумента = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоКодуДокумента.Следующий() Цикл
		
		ОбластьЗаголовокКодДокумента.Параметры.КодДокумента = ВыборкаПоКодуДокумента.КодДокумента;
		ТабличныйДокумент.Вывести(ОбластьЗаголовокКодДокумента, 1); 
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицыОсновной);
		
		Если ВидОтчета = 1 Тогда	
			ОбластьЗаголовокТаблицыДатаОкончания = Макет.ПолучитьОбласть("ЗаголовокТаблицы|ДатаОкончания");  
			ТабличныйДокумент.Присоединить(ОбластьЗаголовокТаблицыДатаОкончания); 
			
			ОбластьСтрокаДатаОкончания = Макет.ПолучитьОбласть("Строка|ДатаОкончания");   			
		КонецЕсли; 		
		
		ТабличныйДокумент.Присоединить(ОбластьЗаголовокТаблицыДанныеКПК);
		
		Если ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21632 Тогда
			ТЗРазделы =  ТЗРазделы_3_2;                                                        			
		ИначеЕсли ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164
			ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
			ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642 
			ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644
			ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда
			ТЗРазделы =  ТЗРазделы_4;
		Иначе
			ТЗРазделы =  ТЗРазделы_3_3;			
		КонецЕсли;
		
		НомерПП = 0;
		СтрокаЧетная = Ложь;
		
		ТекРаздел = "";
		Для Каждого СтрокаРаздела ИЗ ТЗРазделы Цикл 
			
			Если  (ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164
				ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
				ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642
				ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644
				ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165) И Лев(СтрокаРаздела.Раздел.Код, 1)= "9" Тогда
				Продолжить; 				 
			ИначеЕсли  ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2164
				И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21641
				И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21642
				И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21644
				И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2165 И Лев(СтрокаРаздела.Раздел.Код, 1)= "8" Тогда
				 Продолжить;
			КонецЕсли;
				 
			
			Если ТекРаздел <> СтрокаРаздела.Раздел.Родитель И СтрокаРаздела.Раздел.Родитель.Родитель = Справочники.Разделы.ПустаяСсылка() Тогда
				// выводим одителя
				ТекРаздел = СтрокаРаздела.Раздел.Родитель;
				
				НазваниеРаздела = СокрЛП(СтрокаРаздела.Раздел.Родитель.ПолноеНаименование);                  
				
				Если ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 
					ИЛИ  ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда					
					
					Если СтрокаРаздела.Раздел.Родитель.Код = "Раздел4" Тогда                                                              					
						НазваниеРаздела = "Раздел IV. Сведения о членах КПК, заключенных договорах, привлеченных и размещенных средствах";
					КонецЕсли;
				КонецЕсли;
				
				ОбластьЗаголовокТаблицыРаздел.Параметры.НазваниеРаздела = СРО_ЗагрузкаОтчетности.ПолучитьНазваниеРазделаПоКодуДокумента(СтрокаРаздела.Раздел.Родитель, ВыборкаПоКодуДокумента.КодДокумента);
				//ОбластьЗаголовокТаблицыРаздел.Параметры.НазваниеРаздела =НазваниеРаздела;
				
				ОбластьЗаголовокТаблицыРаздел.Параметры.КодРаздела = "";
				
				ОбластьЗаголовокТаблицыРаздел.Область(1, 1, 1, 1).ЦветФона = webЦвета.СветлоЗеленый;	
				ТабличныйДокумент.Присоединить(ОбластьЗаголовокТаблицыРаздел, 1);       
			
				счКолонок = счКолонок + 1;    
				ОбластьЗаголовокТаблицыРаздел.Параметры.КодРаздела = СокрЛП(СтрокаРаздела.Раздел.КодРаздела);
			//	ОбластьЗаголовокТаблицыРаздел.Параметры.НазваниеРаздела = СокрЛП(СтрокаРаздела.РазделПолноеНаименование);
				ОбластьЗаголовокТаблицыРаздел.Параметры.НазваниеРаздела = СРО_ЗагрузкаОтчетности.ПолучитьНазваниеРазделаПоКодуДокумента(СтрокаРаздела.Раздел, ВыборкаПоКодуДокумента.КодДокумента);
				ОбластьЗаголовокТаблицыРаздел.Область(1, 1, 1, 1).ЦветФона = webЦвета.Белый;	
				ТабличныйДокумент.Присоединить(ОбластьЗаголовокТаблицыРаздел, 2);        								
			Иначе 				
				счКолонок = счКолонок + 1; 
				ОбластьЗаголовокТаблицыРаздел.Параметры.КодРаздела = СокрЛП(СтрокаРаздела.Раздел.КодРаздела);
				//ОбластьЗаголовокТаблицыРаздел.Параметры.НазваниеРаздела = СокрЛП(СтрокаРаздела.РазделПолноеНаименование);
				ОбластьЗаголовокТаблицыРаздел.Параметры.НазваниеРаздела = СРО_ЗагрузкаОтчетности.ПолучитьНазваниеРазделаПоКодуДокумента(СтрокаРаздела.Раздел, ВыборкаПоКодуДокумента.КодДокумента);
	
				ОбластьЗаголовокТаблицыРаздел.Область(1, 1, 1, 1).ЦветФона = webЦвета.Белый;	
				ТабличныйДокумент.Присоединить(ОбластьЗаголовокТаблицыРаздел, 2);   
			КонецЕсли;			
		КонецЦикла; 		
		
		ВыборкаПоКПК = ВыборкаПоКодуДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКПК.Следующий() Цикл
			
			Если ВидОтчета = 1 Тогда			
				ОбластьЗаголовокКПК.Параметры.КПКНаименованиеПолное = СокрЛП(ВыборкаПоКПК.КПК.НаименованиеПолное);
				ТабличныйДокумент.Вывести(ОбластьЗаголовокКПК, 2); 
			КонецЕсли;
			
			ВыборкаПоДокументуОтчетности = ВыборкаПоКПК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоДокументуОтчетности.Следующий() Цикл
				
				КПК = ВыборкаПоКПК.КПК;
				ДокументОтчетности = ВыборкаПоДокументуОтчетности.ДокументОтчетности;
				                             				
				Если СтрокаЧетная Тогда
					ОбластьСтрокаОсновной.Область(1, 1, 1, 3).ЦветФона = WebЦвета.ШелковыйОттенок; 
					Если ВидОтчета = 1 Тогда
						ОбластьСтрокаДатаОкончания.Область(1, 1, 1, 1).ЦветФона = WebЦвета.ШелковыйОттенок; 
					КонецЕсли;
				Иначе
					ОбластьСтрокаОсновной.Область(1, 1, 1, 3).ЦветФона = WebЦвета.Белый;
					Если ВидОтчета = 1 Тогда
						ОбластьСтрокаДатаОкончания.Область(1, 1, 1, 1).ЦветФона = WebЦвета.Белый;  
					КонецЕсли;
				КонецЕсли;
				
				НомерПП = НомерПП + 1;
			
				ОбластьСтрокаОсновной.Параметры.НомерВРеестреСРО = СокрЛП(КПК.НомерВРеестреСРО);    		
				ОбластьСтрокаОсновной.Параметры.КраткоеНазваниеКПК = СокрЛП(КПК.НаименованиеКраткое);  	
				
				ОбластьСтрокаОсновной.Параметры.НомерПП = НомерПП;    		
				
				ОбластьСтрокаОсновной.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
				
				ОбластьСтрокаОсновной.Параметры.ДокументОтчетности  = ДокументОтчетности;
				ТабличныйДокумент.Вывести(ОбластьСтрокаОсновной, 3);   
				
				Если ВидОтчета = 1 Тогда
					ОбластьСтрокаДатаОкончания.Параметры.ПериодОтчетности = ВыборкаПоДокументуОтчетности.ДокументОтчетности.ДатаОкончанияОтчетногоПериода; 				
					ТабличныйДокумент.Присоединить(ОбластьСтрокаДатаОкончания); 
				КонецЕсли;
				
				// Выводим данные по ЯКПК
				
				//АдресМестонахождения = "";
				//
				//ТаблицаАдресовМестаНахождения = ДокументОтчетности.ТаблицаАдресовМестаНахождения;
				//Если ТаблицаАдресовМестаНахождения.Количество()> 0 Тогда
				//	АдресМестонахождения = СокрЛП(ТаблицаАдресовМестаНахождения[0].Адрес);
				//КонецЕсли;
				
			//	АдресМестонахождения = СокрЛП(ДокументОтчетности.КПКАдресФактическогоМестонахождения);    
			
				АдресМестонахождения = "";
				
				СтрокаАдреса = ТЗАдреса.Найти(КПК, "КПК");   
				
				Если СтрокаАдреса <> Неопределено Тогда    
					АдресМестонахождения = СокрЛП(СтрокаАдреса.ПредставлениеАдреса);					
				КонецЕсли;
					
				ОбластьДанныеКПК.Параметры.ИНН = СокрЛП(ДокументОтчетности.КПКИНН);   
				ОбластьДанныеКПК.Параметры.ОГРН = СокрЛП(ДокументОтчетности.КПКОГРН);   
				ОбластьДанныеКПК.Параметры.АдресМестонахождения = АдресМестонахождения;  
				ОбластьДанныеКПК.Параметры.Субъект = СокрЛП(КПК.Субъект);  	  				
				ОбластьДанныеКПК.Параметры.АдресЭлектроннойПочты = СокрЛП(ДокументОтчетности.КПКАдресЭлектроннойПочты);   
				ОбластьДанныеКПК.Параметры.НомерТелефона = СокрЛП(ДокументОтчетности.КПКНомерТелефона);   
				ОбластьДанныеКПК.Параметры.ДатаВступленияВСРО = Формат(КПК.ДатаВступленияВСРО, "ДФ=dd.MM.yyyy");    				
				ОбластьДанныеКПК.Параметры.АдресПочтовый =  СокрЛП(ДокументОтчетности.КПКПочтовыйАдрес);  				
				ОбластьДанныеКПК.Параметры.ДатаРегистрацииКПК = Формат(КПК.ДатаРегистрацииКПК, "ДФ=dd.MM.yyyy");       				
				ОбластьДанныеКПК.Параметры.ДолжностьРуководителя = СокрЛП(ВыборкаПоДокументуОтчетности.Должность);   

				
				//
				//Генеральный директор
				//
				//Директор
				//И.О. директора
				//
				
				
				Если СтрокаЧетная Тогда
					ОбластьДанныеКПК.Область(1, 1, 1, 10).ЦветФона = WebЦвета.ШелковыйОттенок;
				Иначе
					ОбластьДанныеКПК.Область(1, 1, 1, 10).ЦветФона = WebЦвета.Белый;
				КонецЕсли;     					
					
				ТабличныйДокумент.Присоединить(ОбластьДанныеКПК);   				
				
				ТекРаздел = ""; 
				Выборка= ВыборкаПоДокументуОтчетности.Выбрать();
				
				МассивКодовКорневыхРазделов = Новый Массив;
				
				Пока Выборка.Следующий() Цикл 	
					
					
					Если  (ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164
						ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
						ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642
						ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644
						ИЛИ ВыборкаПоКодуДокумента.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165) И Лев(Выборка.Раздел.Код, 1)= "9" Тогда
						 Продолжить;						 
					 ИначеЕсли  ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2164
						 И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21641
						 И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21642
						 И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21644
						 И ВыборкаПоКодуДокумента.КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2165 И Лев(Выборка.Раздел.Код, 1)= "8" Тогда
						 Продолжить;
					КонецЕсли;
				 

					
					ЗначениеПоказателя = "";
					
					Если Выборка.Показатель1 = -99999 Тогда
						ЗначениеПоказателя = "Х";  
					ИначеЕсли Выборка.Показатель1 = -77777 Тогда
						ЗначениеПоказателя = "-";  	
					ИначеЕсли Выборка.Показатель1 <> 0 Тогда
						ЗначениеПоказателя = Выборка.Показатель1;
					Иначе
						Если Выборка.Показатель1 = 0 Тогда
							ЗначениеПоказателя = "0";
						иначеЕсли Выборка.Показатель2 = 0 Тогда
							ЗначениеПоказателя = "0";	
						иначеЕсли Выборка.Показатель3 = 0 Тогда
							ЗначениеПоказателя = "0";		
						иначеЕсли Выборка.Показатель4 = 0 Тогда
							ЗначениеПоказателя = "0";
						иначеЕсли Выборка.Показатель5 = 0 Тогда
							ЗначениеПоказателя = "0";		
						иначеЕсли Выборка.Показатель6 = 0 Тогда
							ЗначениеПоказателя = "0";		
						КонецЕсли;
						
					КонецЕсли; 
					
					КодРаздела = СокрЛП(Выборка.Раздел.Код); 				
					Поз = СтрНайти(Выборка.Раздел.Код, "_");
					
					КодКорневогоРаздела = Лев(КодРаздела, Поз - 1);
					
					Если МассивКодовКорневыхРазделов.Найти(КодКорневогоРаздела) = Неопределено Тогда
						
						МассивКодовКорневыхРазделов.Добавить(КодКорневогоРаздела);
						
						ОбластьСтрокаРаздел.Параметры.ЗначениеПоказателя = "";   				
						ОбластьСтрокаРаздел.Область(1, 1, 1, 1).ЦветФона = webЦвета.СветлоЗеленый;
						ТабличныйДокумент.Присоединить(ОбластьСтрокаРаздел);  					
					КонецЕсли;
					
					Если СтрокаЧетная Тогда
						ОбластьСтрокаРаздел.Область(1, 1, 1, 1).ЦветФона = WebЦвета.ШелковыйОттенок;
					Иначе
						ОбластьСтрокаРаздел.Область(1, 1, 1, 1).ЦветФона = WebЦвета.Белый;
					КонецЕсли;
					
					ОбластьСтрокаРаздел.Параметры.ЗначениеПоказателя = ЗначениеПоказателя; //  КодРаздела;
					ТабличныйДокумент.Присоединить(ОбластьСтрокаРаздел);  
					
				КонецЦикла;	
				
				СтрокаЧетная = ?(СтрокаЧетная, Ложь, Истина);  		
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуКолонок(); 
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок(); 
	
	ТабличныйДокумент.ФиксацияСверху = 7;
	ТабличныйДокумент.ФиксацияСлева = 3;   	
	
	МассивТабДокументов = Новый Массив;
	МассивТабДокументов.Добавить(ТабличныйДокумент);
	
	Возврат МассивТабДокументов;
	
КонецФункции
